GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c

//*******1*********2*********3*********4*********5*********6*********7**********
//
//                           board_STM32_adc.c
//
//
//  Common Logic for ADC support for STM32 MCUs.
//
//  Uses a combination of HAL_Library (mostly for configuration) and direct
//  register calls (main execution).
//
//  Specific chip dependences are mainly constrained to tables (GPIOs used
//  specific ADC modules supported, etc). They are pulled in as #includes
//  based MCU type.
//
//  In general, the use of #ifdefs within the code has been minimized, in
//  order to keep things read-able and maintainable.
//
//  History:
//    12/30/14 - Created for Industrial IoT OpenSource project.  Duq
//    04/12/15 - Added multi-channel ADC support. Duq
//    05/25/15 - Fixed lingering issues in ADC DMA support. Duqu
//    07/18/15 - Reworked to provide better factoring. Duq
//
// The MIT License (MIT)
//
// Copyright (c) 2014-2015 Wayne Duquaine / Grandview Systems
//
// Permission is hereby granted, free of charge, to any person obtaining a copy
// of this software and associated documentation files (the "Software"), to deal
// in the Software without restriction, including without limitation the rights
// to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
// copies of the Software, and to permit persons to whom the Software is
// furnished to do so, subject to the following conditions:
// 
// The above copyright notice and this permission notice shall be included in
// all copies or substantial portions of the Software.
// 
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
// IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
// AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
// THE SOFTWARE.
//*****************************************************************************

#include "user_api.h"               // pull in defs for User API calls

#include <math.h>

#define  INT_OFFSET      4          // Indexing offset used for Internal Sensors

   //---------------------------------------------------------------------------
   //               Summary of key ADC Characteristics by MCU
   //
   //  MCU     Num    Num Ext    DMA           DMA            IRQ
   //          ADC    Channels   Used          Channel        Vector
   //          ----   --------   -----         --------       -------
   //  F0_72   ADC1    0-15      DMA1          DMA1_Channel1  DMA1_Channel1_IRQn
   //  F0_91   ADC1    0-15      DMA1          DMA1_Channel1  DMA1_Channel1_IRQn
   //
   //  F4_01   ADC1    0-15      DMA2_Stream0  DMA_CHANNEL_0  DMA2_Stream0_IRQn
   //  F4_11   ADC1    0-15      DMA2_Stream0  DMA_CHANNEL_0  DMA2_Stream0_IRQn
   //  F4_46   ADC1    0-15 ?    DMA2_Stream0  DMA_CHANNEL_0  DMA2_Stream0_IRQn
   //
   //---------------------------------------------------------------------------

     //-------------------------------------------------------------------------
     // Global Defines needed by ADC support
     //-------------------------------------------------------------------------

typedef struct adc_module_def           /* ADC Module definitions */
    {
        ADC_TypeDef  *adc_base;         /* ADC base address */
    } ADC_MODULE_BLK;


typedef struct adc_ctl_io_ctl_def       /* ADC Control and Status definition */
   {
     ADC_HandleTypeDef  adc_Handle;     // ADC module typedef handle
     DMA_HandleTypeDef  dma_Handle;     // DMA module typedef handle
     ADC_TypeDef  *adc_hw_base;         // Hardware address of ADC Module
       uint16_t   dma_stream_IRQn;      // IRQn for this module's DMA

       short      adc_module_id;
       char       adc_clocks_on;        // 1 = ADC/DMA clocks were enabled
       char       adc_active_channels;  // total # active configured channels
       uint16_t   adc_step_num;         // current step number to use for sequencer
       uint8_t    adc_step_map [28];    // copy of which ADC channel used in which step

       char       ADC_complete;         // 1 = all non-DMA ADC conversions are complete
       char       ADC_DMA_complete;     // 3 = all DMA'ed  ADC conversions are complete
       uint16_t   adc_DMA_overrun;      // 1 = ADC overrun detected ==> bug !

       uint16_t   adc_conv_results[22]; // Internal buf to hold ADC DMAed results

       ADC_CB_EVENT_HANDLER  adc_callback_handler; // optional callback routine
       void       *adc_callback_parm;              // user callback parm

       uint16_t   adc_trigger_user_api_id; // User API id for the trigger
       uint16_t   adc_trigger_timer;       // Index to correct Timer/PWM - was _g_trigger_atmrpwm
       uint16_t   adc_trigger_tmr_mmsmask; // Associated Mask for TIM MMS
       uint32_t   adc_trigger_adc_extmask; // Associated Mask for ADC EXTSEL
   } ADC_IO_CONTROL_BLK;


typedef struct adc_channel_def        /* ADC Channel definitions */
    {
        GPIO_TypeDef *chan_gpio_port; /* Associated GPIO port             */
        uint32_t     chan_gpio_pin;   /* Associated GPIO pin              */
        uint32_t     chan_alt_func;   /* Channel Alternate Function Id    */
        uint16_t     chan_adc_id;     /* Logical Channel id for this ADC  */
        uint16_t     chan_adc_mask;   /* Allowed ADC usage mask: 1/3/7/15 */
//VVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVVV  BIGGIE F7 and F3
        ADC_TypeDef  *chan_adc_module;/* Default ADC Module to use        */
    } ADC_CHANNEL_BLK;

            // states for ADC_DMA_complete
#define  ADC_DMA_STATE_RESET         0
#define  ADC_DMA_STATE_BUSY          1     // User Trigger I/O request started
#define  ADC_DMA_STATE_INITAL_START  2
#define  ADC_DMA_STATE_IO_COMPLETE   3     // DMA has signaled completion of I/O
#define  ADC_DMA_STATE_RESULTS_READ  4     // adc_Read() was called
#define  ADC_DMA_STATE_IO_ERROR      5     // Overrun or ADC_Start error

