GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
typedef struct adc_trigger_def         /* ADC Trigger definitions */
    {
        uint16_t     trigger_user_api_id; /* User API id for the trigger   */
        uint16_t     trigger_tmr_mmsmask; /* Associated Mask for TIM MMS   */
        uint32_t     trigger_adc_extmask; /* Associated Mask for ADC EXTSEL*/
    } ADC_TRIGGER_BLK;


     //----------------------------------------
     //        Function Prototype refs
     //           internal use only
     //----------------------------------------
void  DMA1_Channel1_IRQHandler (void);             // ADC DMA ISR - all channels
void  DMA2_Stream0_IRQHandler (void);              // ADC DMA ISR - all channels
void  DMA2_Stream2_IRQHandler (void);              // DMA for ADC2
void  DMA2_Stream1_IRQHandler (void);              // DMA for ADC3

void  ADC1_DMA_IRQHandler (void);                  // ADC only (no-DMA) ISR

ADC_IO_CONTROL_BLK  *board_adc_get_io_control_block (unsigned int module_id);
ADC_CHANNEL_BLK  *board_adc_get_channel_block (int module_id, int channel_num);
ADC_TRIGGER_BLK  *board_adc_get_trigger_block (int module_id, int trigger_type);
ADC_TRIGGER_BLK  *board_adc_lookup_trigger (unsigned int module_id, int trigger_type,
                                        ADC_IO_CONTROL_BLK *adc_blk, int flags);
void  board_adc_enable_clocks (int module_id);


     //------------------------------------------------------------------------
     //
     // Pull in        MCU dependent GPIO / TIM tables and #defines
     //
     // The top of each module include key defines for:
     //          MAX_TIMERS,
     //          TMRPWM_NUM_MODULES
     //          TMRPWM_MAX_CHANNELS
     //
     // The following tables are pulled in:
     //          _g_timer_module_base[]       table/array
     //          _g_TIMx_TimPwmHandle's
     //          _g_timer_typedef_handle[]    table/array
     //          _g_TMPWM_IRQ_table[]         table/array
     //          _g_timer_base_channel_num[]  table/array
     //          _g_tmrpwm_mod_x_channels []  set of tables/arrays for GPIOs
     //          _g_tmrpwm_mod_channel_blk_lookup []    table/array
     //
     // Also, the following two utility routines are included in those files:
     //        - board_timerpwm_compute_prescalar()  because that is MCU speed
     //                                              and clock specific
     //        - board_timerpwm_enable_clock()       because which Timers are
     //                                              supported and the logic to
     //                                              start them is MCU specific
     //------------------------------------------------------------------------

#if defined(STM32F072xB)
//                                         STM32 - F072  Nucleo
#include "STM32_F0/board_F0_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION12b
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_CHANNEL_LEVEL_SAMPLING_TIME   1
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_28CYCLES_5
#define  ADC_HAS_SQR_L           1
#define  DMA_INSTANCE            DMA1_Channel1
#define  DMA_STREAM_IRQ          DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA1_Channel1_IRQHandler
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32F091xC)
//                                         STM32 - F091  Nucleo
#include "STM32_F0/board_F0_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1                  // THIS MAY BE INCORRECT - DOES F0_91 support 2 ADCs ?
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION12b
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_28CYCLES_5
#define  ADC_HAS_SQR_L           1
#define  DMA_INSTANCE            DMA1_Channel1
#define  DMA_STREAM_IRQ          DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA1_Channel1_IRQHandler
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32F103xB)
//                                         STM32 - F103  Nucleo
#include "STM32_F1/board_F1_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION_12B
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_28CYCLES_5
#define  ADC_HAS_SQR_L           1
#define  DMA_INSTANCE            DMA1_Channel1
#define  DMA_STREAM_IRQ          DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA1_Channel1_IRQHandler
#define  DMA_HAS_FIFO_MODE       1
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32F303xE)
//                                         STM32 - F303  Nucleo
#include "STM32_F3/board_F303_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION12b
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_28CYCLES_5
#define  ADC_HAS_SQR_L           1
#define  DMA_INSTANCE            DMA1_Channel1
#define  DMA_STREAM_IRQ          DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA1_Channel1_IRQHandler
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32F334x8)
//                                         STM32 - F334  Nucleo
#include "STM32_F3/board_F334_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION12b
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_28CYCLES_5
#define  ADC_HAS_SQR_L           1
#define  DMA_INSTANCE            DMA1_Channel1       // 09/03/15 ??? !!! WVD 0- NEEDS WORK - ARE TWO ADC WITH TWO DIFF DMAs (Chan1 and Chan2)
#define  DMA_STREAM_IRQ          DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA1_Channel1_IRQHandler
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


