GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
#if defined(STM32F401xC) || defined(STM32F401xE) || defined(STM32F411xE)
//                                         STM32 - F401 / F411 Nucleo and Discovery
#include "STM32_F4/board_F4x1_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1
//#define  ADC_4_MODULES           1
//#define  ADC_MULTIPLE_MODULES    1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION_12B
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_CHANNEL_LEVEL_SAMPLING_TIME   1
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_56CYCLES    // 56 because of Grove high impedance
#define  ADC_HAS_SQR_L           1
#define  DMA_INSTANCE            DMA2_Stream0
//#define  DMA_CHANNEL_DEFAULT     DMA_CHANNEL_0
#define  DMA_CHANNEL_ADC1        DMA_CHANNEL_0
//#define  DMA_CHANNEL_ADC2        DMA_CHANNEL_1
//#define  DMA_CHANNEL_ADC3        DMA_CHANNEL_2
//#define  DMA_CHANNEL_ADC4        DMA_CHANNEL_3
#define  DMA_STREAM_IRQ          DMA2_Stream0_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA2_Stream0_IRQHandler
#define  DMA_HAS_FIFO_MODE       1
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32F446xx)
//                                         STM32 - F446 Nucleo
#include "STM32_F4/board_F446_tables_adc.c"

#define  ADC_1_MODULES          1
#define  ADC_SINGLE_MODULE      1
//#define  ADC_4_MODULES           1
//#define  ADC_MULTIPLE_MODULES    1
#define  ADC_RESOLUTION_DEFLT   ADC_RESOLUTION_12B
#define  ADC_PRESCALE_DEFLT     ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_CHANNEL_LEVEL_SAMPLING_TIME   1
#define  ADC_SAMPLETIME_DEFLT   ADC_SAMPLETIME_56CYCLES    // 56 because of Grove high impedance
#define  ADC_HAS_SQR_L          1
#define  DMA_INSTANCE           DMA2_Stream0
//#define  DMA_CHANNEL_DEFAULT   DMA_CHANNEL_0
#define  DMA_CHANNEL_ADC1       DMA_CHANNEL_0
//#define  DMA_CHANNEL_ADC2      DMA_CHANNEL_1
//#define  DMA_CHANNEL_ADC3      DMA_CHANNEL_2
//#define  DMA_CHANNEL_ADC4      DMA_CHANNEL_3
#define  DMA_STREAM_IRQ         DMA2_Stream0_IRQn
#define  DMA_ADC1_ISR_IRQHandler DMA2_Stream0_IRQHandler
#define  DMA_HAS_FIFO_MODE      1
#define  GPIO_SET_ANALOG_MODE   GPIO_MODE_ANALOG
#endif


#if defined(STM32F746xx) || defined(STM32F746NGHx)
//                                         STM32 - F746  Discovery
#include "STM32_F7/board_F7_tables_adc.c"

#define  ADC_3_MODULES           1
#define  ADC_MULTIPLE_MODULES    1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION_12B
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_CHANNEL_LEVEL_SAMPLING_TIME   1
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_28CYCLES
#define  ADC_HAS_SQR_L           1
#define  DMA_INSTANCE            DMA2_Stream0
#define  DMA_CHANNEL_DEFAULT     DMA_CHANNEL_3    // ADC 3 is F7 default ADC
#define  DMA_CHANNEL_ADC1        DMA_CHANNEL_0
#define  DMA_CHANNEL_ADC2        DMA_CHANNEL_1
#define  DMA_CHANNEL_ADC3        DMA_CHANNEL_2
#define  DMA_STREAM_IRQ          DMA2_Stream0_IRQn
#define  DMA_ADC1_ISR_IRQHandler DMA2_Stream0_IRQHandler   // ADC1 uses Stream0/Channel_0
#define  DMA_ADC2_ISR_IRQHandler DMA2_Stream2_IRQHandler   // ADC2 uses Stream2/Channel_1
#define  DMA_ADC3_ISR_IRQHandler DMA2_Stream1_IRQHandler   // ADC3 uses Stream1/Channel_2
#define  DMA_HAS_FIFO_MODE       1
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32L053xx)
//                                         STM32 - L053  Nucleo / Discovery
#include "STM32_L0/board_L0_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION12b
#define  ADC_PRESCALE_DEFLT      ADC_CLOCKPRESCALER_PCLK_DIV2
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_28CYCLES_5
#define  ADC_HAS_LOWPOWER_MODE   1
#define  DMA_INSTANCE            DMA1_Channel1
#define  DMA_STREAM_IRQ          DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA1_Channel1_IRQHandler
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32L152xE) || defined(STM32L152xC)
//                                         STM32 - L152  Nucleo / Discovery
#include "STM32_L1/board_L1_tables_adc.c"

#define  ADC_1_MODULES           1
#define  ADC_SINGLE_MODULE       1
#define  ADC_RESOLUTION_DEFLT    ADC_RESOLUTION12b
#define  ADC_PRESCALE_DEFLT      ADC_CLOCK_ASYNC_DIV2
#define  ADC_SAMPLETIME_DEFLT    ADC_SAMPLETIME_24CYCLES
#define  ADC_HAS_SQR_L           1
#define  ADC_HAS_LOWPOWER_MODE   1
#define  DMA_INSTANCE            DMA1_Channel1
#define  DMA_STREAM_IRQ          DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler  DMA1_Channel1_IRQHandler
#define  GPIO_SET_ANALOG_MODE    GPIO_MODE_ANALOG
#endif


#if defined(STM32L476xx)
//                                         STM32 - L476  Discovery/Nucleo
#include "STM32_L4/board_L4_tables_adc.c"

#define  ADC_1_MODULES          1
#define  ADC_SINGLE_MODULE      1
//#define  ADC_3_MODULES        1
//#define  ADC_MULTIPLE_MODULE  1
#define  ADC_RESOLUTION_DEFLT   ADC_RESOLUTION_12B
#define  ADC_PRESCALE_DEFLT     ADC_CLOCKPRESCALER_PCLK_DIV2  // ADC_CLOCK_ASYNC_DIV2
#define  ADC_CHANNEL_LEVEL_SAMPLING_TIME   1
#define  ADC_SAMPLETIME_DEFLT   ADC_SAMPLETIME_24CYCLES_5
#define  ADC_HAS_SQR_L          1
#define  ADC_HAS_LOWPOWER_MODE  1
#define  OVERSAMPLING_ALLOWED   1
#define  DMA_INSTANCE           DMA1_Channel1
#define  DMA_REQUEST_NUM        DMA_REQUEST_0
#define  DMA_STREAM_IRQ         DMA1_Channel1_IRQn
#define  DMA_ADC1_ISR_IRQHandler DMA1_Channel1_IRQHandler
#define  GPIO_SET_ANALOG_MODE   GPIO_MODE_ANALOG_ADC_CONTROL
#endif

//------------------------------------------------------------------------------
//       Handle cross-platform HAL inconsistencies   (e.g. L0, ...)
//------------------------------------------------------------------------------
#ifndef ADC_EXTERNALTRIGCONVEDGE_NONE
#define ADC_EXTERNALTRIGCONVEDGE_NONE           ADC_EXTERNALTRIG_EDGE_NONE
#define ADC_EXTERNALTRIGCONVEDGE_FALLING        ADC_EXTERNALTRIG_EDGE_FALLING
#define ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING  ADC_EXTERNALTRIG_EDGE_RISINGFALLING
#define ADC_EXTERNALTRIGCONVEDGE_RISING         ADC_EXTERNALTRIG_EDGE_RISING
#endif

#ifndef ADC_SOFTWARE_START
#define  ADC_SOFTWARE_START    0
#endif


//*****************************************************************************
//*****************************************************************************
//                      COMMON   TABLES  and  DEFINEs
//
//                               for
//
//                            ADC  Support
//*****************************************************************************
//*****************************************************************************

    ADC_ChannelConfTypeDef  _g_ChanConfig;

       //-----------------------------------------------------------------
       //          Single  ADC Moducle NCUs        (most of product line)
       //-----------------------------------------------------------------
#if defined(ADC_1_MODULES)
    ADC_IO_CONTROL_BLK  _g_adc_io_ctl_block_1;    // key status for ADC 1 (default)

const  ADC_TypeDef   *_g_adc_modules [] =
        {    ADC1,              // [0] = default module = ADCMD
             ADC1,
              0L,
              0L,
              0L
        };
#endif

       //-----------------------------------------------------------------
       //            Two  ADC Moducle NCUs                   (F0_91, ...)
       //-----------------------------------------------------------------
#if defined(ADC_2_MODULES)
    ADC_IO_CONTROL_BLK   _g_adc_io_ctl_block_1;  // key status for ADC 1 (default)
    ADC_IO_CONTROL_BLK   _g_adc_io_ctl_block_2;  // key status for ADC 2 module

const  ADC_TypeDef   *_g_adc_modules [] =
        {  { ADC1 },        // [0] = default module = ADC_AUTO_MODULE
           { ADC1 },
           { ADC2 },
           {  0L  },
           {  0L  }
        };
#endif

       //-----------------------------------------------------------------
       //            Three  ADC Moducle NCUs                   (F7, ...)
       //-----------------------------------------------------------------
#if defined(ADC_3_MODULES)
    ADC_IO_CONTROL_BLK   _g_adc_io_ctl_block_1;  // key status for ADC 1 (default)
    ADC_IO_CONTROL_BLK   _g_adc_io_ctl_block_2;  // key status for ADC 2 module
    ADC_IO_CONTROL_BLK   _g_adc_io_ctl_block_3;  // key status for ADC 3 module

const  ADC_TypeDef   *_g_adc_modules [] =
        {  { ADC3 },        // [0] = default module = ADCMD
           { ADC1 },
           { ADC2 },
           { ADC3 },
           {  0L  }
        };
#endif

       //-----------------------------------------------------------------
       //            Four  ADC Moducle NCUs                 (L4, F3, ...)
       //-----------------------------------------------------------------
#if defined(ADC_4_MODULES)
    ADC_IO_CONTROL_BLK     _g_adc_io_ctl_block_1;  // key status for ADC 1 (default)
    ADC_IO_CONTROL_BLK     _g_adc_io_ctl_block_2;  // key status for ADC 2 module
    ADC_IO_CONTROL_BLK     _g_adc_io_ctl_block_3;  // key status for ADC 3 module
    ADC_IO_CONTROL_BLK     _g_adc_io_ctl_block_4;  // key status for ADC 4 module

const  ADC_TypeDef   *_g_adc_modules [] =
        {  { ADC3 },        // [0] = default module = ADC_AUTO_MODULE
           { ADC1 },
           { ADC2 },
           { ADC3 },
           { ADC4 }
        };
#endif


