GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
///  char             _g_ADC_complete    = 0;  // 1 = all ADC conversions/DMAs are complete
///  char             _g_adc_clocks_on   = 0;
///  char             _g_active_channels = 0;
///  uint16_t         _g_sequencer       = 0;
///  uint16_t         _g_step_num        = 1;  // first sequencer step always = 1

///  unsigned char    _g_adc_step_map [16] = { 0 };  // indexed by channel #

///  unsigned short   _g_adc_conv_results[16];    // Internal buf to hold ADC DMAed results

//ADC_CB_EVENT_HANDLER _g_adc_callback       = 0L;
//   void              *_g_adc_callback_parm = 0;

///  uint16_t         _g_trigger_atmrpwm      = 0; // index to correct Timer/PWM
///  uint16_t         _g_trigger_auser_api_id = 0; // User API id for the trigger
///  uint16_t         _g_trigger_atmr_mmsmask = 0; // Associated Mask for TIM's  MMS
///  uint32_t         _g_trigger_adc_extmask  = 0; // Associated mask for ADC CR2 EXTSEL

///  int              _g_DMA_complete  = 0;       // 1 = all ADC conversion DMAs are complete
///  char             _g_DMA_overrun   = 0;       // 1 = DMA completed a new set before the
                                                 // previous one was processed

    unsigned long    dma_callback_seen = 0;      // DEBUG COUNTERs
    unsigned long    dma_rupt_seen     = 0;
    unsigned long    adc_rupt_cb_seen  = 0;


//*****************************************************************************
//*****************************************************************************
//                           COMMON   ADC   Code
//
//                                    for
//
//                                STM32  MCUs
//*****************************************************************************
//*****************************************************************************

//*****************************************************************************
//  board_adc_init
//
//         Initialize an ADC module, and configure the overall sampling
//         clock used for the ADC channels on a module.
//
//         The default is set to XXXX.
//         This call allows an experienced programmer to override that default.
//
//         trigger_type specifies the type of trigger that will be used
//           - User App
//           - PWM Module 0  Generator 0 / 1 / 2 / 3
//           - PWM Module 1  Generator 0 / 1 / 2 / 3
//           - Timer n
//           - Comparator n
//
// Note that on most platforms, the Triggering is _module_ wide, in other
//      words, all channels (ADC 1-16) will be triggered off the same timer/pwm.
// Note that on most platforms, the Triggering is _module_ wide, in other
//      words, all channels (ADC 1-16) will be triggered off the same timer/pwm.
//
// STM32-F0 has 1 ADC moodule, with a single sequencer allowing up to 16 channels.
// STM32-F7 has 3 ADC moodules, with a single sequencer allowing up to 16 channels.
// STM32-F4 has 1 ADC moodule, with a single sequencer allowing up to 16 channels.
// The sequencer steps are individually identified:  ADC_SQR1 -> ADC_SQR3.
// ADC results are stored in a single 32-bit register: ADC_DR
// Results are stored in the lower order 16-bits.
// We use DMA to process multiple ADC conversion results, to avoid
// "interrupt per channel" overhead and complexity.
//
// The STM32-F0 Nucleo 64-pin device physically supports up to 16 channels,
// The STM32-F7 Discovery 200-pin device physically supports up to 16 channels,
// The STM32-F4 Nucleo 64-pin device physically supports up to 16 channels,
// of which 5 are wired out to the Nucleo/Arduino pins.
// Two internal sources (Temperature Sensor, Battery Monitor) are also available.
// The other ADCs are wired out to the "Morpho" connector.
// We allow support for all 16 channels.
//
// The STM32-F0 supports a single 12-bit ADC, with up to 16 Channels.
// The STM32-F7 supports three 12-bit ADCs, with up to 16 Channels.
// The STM32-F4 supports a single 12-bit ADC, with up to 16 Channels.
//*****************************************************************************

int  board_adc_init (unsigned int module_id, uint32_t clock_rate,  int trigger_type,
                     int flags)
{
    ADC_IO_CONTROL_BLK  *adc_blk;
    ADC_TRIGGER_BLK     *trigblkp;
    int                 rc;

       //------------------------------------------------------------------
       // Get the associated control and status params for this ADC module
       //------------------------------------------------------------------
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if (adc_blk->adc_clocks_on == 0)
       {    //------------------------------------------------
            // turn on the ADC and DMA clocks for this module
            //------------------------------------------------
         board_adc_enable_clocks (module_id);

            //-------------------------------------------------------------
            // reset this module's ADC Control/Status Block to its default state
            //-------------------------------------------------------------
         memset (adc_blk, 0, sizeof(ADC_IO_CONTROL_BLK));
         adc_blk->adc_module_id = module_id;
         adc_blk->adc_step_num  = 1;      // first sequencer step always = 1
         adc_blk->adc_hw_base   = (ADC_TypeDef*) _g_adc_modules [module_id];  // set ADC Hardware Base Address
         adc_blk->dma_stream_IRQn = DMA_STREAM_IRQ; // save associated NVIC IRQn

         adc_blk->adc_clocks_on = 1;      // denote clocks are now on

             //-----------------------------------------------------------------
             //                           ADC   CONFIG
             //
             // This is the opportune time to do initial config of the ADC and
             // DMA modules. Note that we will later have to manuually override
             // the initial number of ADC channels (set SQR1 xxxx value).
             //
// ??? CALIBRATION
             // If calibration is required, call that out as a separate subrtn.
             // Because F4 only has 1 ADC module, we can hard-code it.
             //-----------------------------------------------------------------
         adc_blk->adc_Handle.Instance = adc_blk->adc_hw_base; // instance = ADC module HW address
         adc_blk->adc_Handle.Init.DMAContinuousRequests = ENABLE;  // Use DMA
         adc_blk->adc_Handle.Init.EOCSelection          = DISABLE; // DMA will interrupt
                                                                   //   not ADC EOC.
#if ! defined(STM32L053xx)
         adc_blk->adc_Handle.Init.ScanConvMode          = ENABLE;  // scan multiple channels
#endif
         adc_blk->adc_Handle.Init.ContinuousConvMode    = DISABLE; // no continuous firing
         adc_blk->adc_Handle.Init.DiscontinuousConvMode = DISABLE;
         adc_blk->adc_Handle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
         adc_blk->adc_Handle.Init.Resolution            = ADC_RESOLUTION_DEFLT; // 12 bit resol
#if defined(ADC_CLOCKPRESCALER_PCLK_DIV2)
         adc_blk->adc_Handle.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV2;
#else
         adc_blk->adc_Handle.Init.ClockPrescaler        = ADC_CLOCK_ASYNC_DIV2;
#endif

#if defined(ADC_MODULE_LEVEL_SAMPLING_TIME)
         adc_blk->adc_Handle.Init.SamplingTime          = ADC_SAMPLETIME_DEFLT;
#endif
         if (trigger_type == ADC_TRIGGER_USER_APP)
            {     //-----------------------------------------------------------
                  // no external triggers - use SW trigger calls from User App
                  //-----------------------------------------------------------
              adc_blk->adc_Handle.Init.ExternalTrigConv     = ADC_SOFTWARE_START;
              adc_blk->adc_Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
            }
          else
            {      //-------------------------------------------------------------
                   // loop thru trigger table, find entry, and save needed flags.
                   //
                   // We do not turn on all the trigger related TIM flags
                   // until adc_enable() is requested.
                   // We also require the User App issue a timer_ADC_Trigger_Start()
                   // at some point, to cause the ADC to start sampling.
                   //-------------------------------------------------------------
              trigblkp = (ADC_TRIGGER_BLK*) board_adc_get_trigger_block (module_id,
                                                                  trigger_type);
              if (trigblkp == 0L)
                 return (ERR_ADC_UNSUPPORTED_TRIGGER_TYPE);  // end of table and no match

                   // setup adc_blk->adc_Handle.Init with proper Trigger flags
              adc_blk->adc_Handle.Init.ExternalTrigConv = trigblkp->trigger_adc_extmask;
              if (flags & ADC_TRIGGER_FALLING)
                 adc_blk->adc_Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_FALLING;
                 else if (flags & ADC_TRIGGER_RISEFALL)
                         adc_blk->adc_Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING;
                         else adc_blk->adc_Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
                   //---------------------------------------------------------------------
                   // save rest of parms to be used at adc_enable() and timerpwm_enable()
                   //---------------------------------------------------------------------
              adc_blk->adc_trigger_adc_extmask = trigblkp->trigger_adc_extmask; // ADC EXTSEL
              adc_blk->adc_trigger_tmr_mmsmask = trigblkp->trigger_tmr_mmsmask; // TIM MMS
              adc_blk->adc_trigger_user_api_id = trigger_type;
                   // the User API trigger type is an encoded field
                   // where the low order 4 bits = CCR, and the rest = index
                   // number of associated Timer/PWM
              if (trigblkp->trigger_tmr_mmsmask != 0)             // if is a EXTI GPIO pin = 0
                adc_blk->adc_trigger_timer = (trigger_type >> 4); // else save Timer/PWM index
            }

#if defined(ADC_HAS_SQR_L)
  #if defined(STM32F072xB) || defined(STM32F091xC)
              // F0 uses ADC_CHSEL sequencer bits that was setup in call to
              // HAL_ADC_Channel_Config
  #else
         adc_blk->adc_Handle.Init.NbrOfConversion  = 1;  // Initial value - this gets modified
                                                         // Does NOT exist as a parm on L0/F0
  #endif
#endif
               // L0 / L1 / L4 have various LowPower options
#if defined(ADC_HAS_LOWPOWER_MODE)
         adc_blk->adc_Handle.Init.LowPowerAutoWait      = ENABLE;
  #if defined(STM32L152xE) || defined(STM32L152xC)
         adc_blk->adc_Handle.Init.LowPowerAutoWait      = DISABLE;  // 09/02/15 - WVD DEBUG see ADC code  0x201 (CR2) vs 0x200 (failure_bits)
         adc_blk->adc_Handle.Init.LowPowerAutoPowerOff  = DISABLE;
  #endif
  #if defined(STM32L476xx) || defined(STM32L152xE) || defined(STM32L152xC)
            // these do not have LowPowerFrequencyMode / LowPowerAutoOff
  #else
         adc_blk->adc_Handle.Init.LowPowerAutoOff       = DISABLE; // ONLY exist for L0
         adc_blk->adc_Handle.Init.LowPowerFrequencyMode = ENABLE;
  #endif
#endif

#if defined(OVERSAMPLING_ALLOWED)
         adc_blk->adc_Handle.Init.OversamplingMode      = DISABLE;
#endif
         rc = HAL_ADC_Init (&adc_blk->adc_Handle);
         if (rc != HAL_OK)
            {
                 /* Initialization Error */
              return (ERR_ADC_INITIALIZATION_ERROR);
            }

             //-----------------------------------------------------------------
             //                           DMA   CONFIG
             //
             // Initialize the DMA associated with the ADC module.

             // F3_34 has only 1 DMA module with 7 channels, and no FIFO, no Burst.
             //-----------------------------------------------------------------
#if defined(DMA_CHANNEL_ADC1)               // single separate DMA channel
         adc_blk->dma_Handle.Init.Channel = DMA_CHANNEL_ADC1;
#endif
#if defined(DMA_CHANNEL_ADC2)               // several separate DMA channels
             // MCUs with multiple ADC modules will have separate channels
         if (module_id == 1)
            adc_blk->dma_Handle.Init.Channel = DMA_CHANNEL_ADC1;
            else if (module_id == 2)
                    adc_blk->dma_Handle.Init.Channel = DMA_CHANNEL_ADC2;
            else if (module_id == 3)
                    adc_blk->dma_Handle.Init.Channel = DMA_CHANNEL_ADC3;
            else if (module_id == ADCMD)
                    adc_blk->dma_Handle.Init.Channel = DMA_CHANNEL_DEFAULT;
#endif
#if defined(DMA_REQUEST_NUM)
         adc_blk->dma_Handle.Init.Request    = DMA_REQUEST_NUM;       // L4 only
#endif
         adc_blk->dma_Handle.Instance        = DMA_INSTANCE;
         adc_blk->dma_Handle.Init.Direction  = DMA_PERIPH_TO_MEMORY;  // ADC -> RAM
         adc_blk->dma_Handle.Init.PeriphInc  = DMA_PINC_DISABLE;
         adc_blk->dma_Handle.Init.MemInc     = DMA_MINC_ENABLE;       // step buf ptr
         adc_blk->dma_Handle.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;  // for 16 bit results
         adc_blk->dma_Handle.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;  // ditto
         adc_blk->dma_Handle.Init.Mode       = DMA_CIRCULAR;     // Treat as circular buf
         adc_blk->dma_Handle.Init.Priority   = DMA_PRIORITY_HIGH;
#if defined(DMA_HAS_FIFO_MODE)
         adc_blk->dma_Handle.Init.FIFOMode   = DMA_FIFOMODE_DISABLE;
         adc_blk->dma_Handle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
         adc_blk->dma_Handle.Init.MemBurst   = DMA_MBURST_SINGLE;
         adc_blk->dma_Handle.Init.PeriphBurst = DMA_PBURST_SINGLE;
              // Note that F3/L0/F0 DMA do not have tunable FIFOs, so no FIFO parms
#endif
         rc = HAL_DMA_Init (&adc_blk->dma_Handle);

