GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
              // Associate the initialized DMA handle to the the ADC handle
         __HAL_LINKDMA (&adc_blk->adc_Handle, DMA_Handle, adc_blk->dma_Handle);

              //----------------------------------------------------------
              //          Configure the NVIC for DMA interrupts
              // Configure NVIC for DMA transfer complete interrupt.
              //----------------------------------------------------------
         HAL_NVIC_SetPriority (DMA_STREAM_IRQ, 0, 0);
         HAL_NVIC_EnableIRQ (DMA_STREAM_IRQ);
       }

    return (0);           // denote success
}


//*****************************************************************************
//  board_adc_config_channel
//
//         Configure a single ADC channel.
//
//         Note that the sampling rate will be determined by the trigger source.
//
//         adc_module parm is really just an index number (0-3)
//         that denote which ADC module to use.
//         For the STM32 F4, there is only 1 ADC module: ADC1
//         For the STM32 F7, there is only 3 ADC modules: ADC1, ADC2, ADC3
//         Nearly all of the 16 channels are connected to ADC3, and alternative
//         paths are defined to allow parallel operation with ADC1 or ADC2.
//
//         The flags value is passed to denote:
//           - priority 0-3                            (NOW)
//           - if interrupts and/or DMA should be used (FUTURE UPGRADE)
//           - Comparator and/or Reference used        (FUTURE_UPGRAGDE)
//
//         STM32 F4 supports a max of 16 ADC channels and 1 ADC module.
//         It has only 1 main sequencer.

//         STM32 F7 supports a max of 16 ADC channels and 3 ADC modules.
//         It has only 1 main sequencer.
//                    ^^^^^^^^^^^^^^^^^^^^
//                  sequencer per ADC ?  ==> array of sequncer/step values[module]id]

//         STM32 F3_34 supports a max of 19 ADC channels and 2 ADC modules.
//         It has only 2 main sequencers (one per ADC module).
//         We default to use ADC1, unless overridcen by user.

//         We do not use the sequencer parameter. It is for cross-platform
//         compatibility, for those platforms that have multiple sequencers.
//*****************************************************************************

int  board_adc_config_channel (unsigned int module_id, int channel_num,
                               int sequencer,  int step_num,
                               int last,  int flags)
{
    GPIO_InitTypeDef  GPIO_InitStruct;
    int               orig_step_num;
    int               rc;
    ADC_IO_CONTROL_BLK   *adc_blk;
    ADC_CHANNEL_BLK   *chan_blkp;

    memset (&GPIO_InitStruct, 0, sizeof(GPIO_InitStruct));  // clear struct

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if ( ! adc_blk->adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

    if (channel_num < ADC_INTERNAL_TEMP  ||  channel_num > ADC_MAX_CHANNELS)
       return (ERR_ADC_CHANNEL_NUM_OUT_OF_RANGE);

          //-----------------------------------------------------
          //                Config  GPIO  pin  for  ADC
          //
          // set the associated GPIO pin to act as an ADC input.
          //
          // Convert channel number to an index into table of 16 entries
          // that contains pin # and GPIO base index, then use  _g_gpio_base[]
          //----------------------------------------------------
    chan_blkp = (ADC_CHANNEL_BLK*) board_adc_get_channel_block (module_id,
                                                                channel_num);
    if (chan_blkp == 0L)
       return (ERR_ADC_CHANNEL_NUM_OUT_OF_RANGE);

    if (chan_blkp->chan_gpio_port != 0L)
       {   //---------------------------------------------------------------------
           // this is a real physical channel - setup associated GPIO pin for ADC.
           // Internal ADC channels (TEMP, VBAT, VREF) do not have any GPIO pins.
           //---------------------------------------------------------------------
           // first configure it as a straight GPIO Input, to clear everything out
         GPIO_InitStruct.Pin   = chan_blkp->chan_gpio_pin;
         GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;
         GPIO_InitStruct.Pull  = GPIO_NOPULL;
         GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
         HAL_GPIO_Init (chan_blkp->chan_gpio_port, &GPIO_InitStruct);
           // then configure it over to an Analog Input
         GPIO_InitStruct.Pin  = chan_blkp->chan_gpio_pin;
         GPIO_InitStruct.Mode = GPIO_SET_ANALOG_MODE;
         GPIO_InitStruct.Pull = GPIO_NOPULL;
         HAL_GPIO_Init (chan_blkp->chan_gpio_port, &GPIO_InitStruct);
       }
     else ;   // chan_blkp->chan_gpio_port == 0L denotes an internal TEMP/VBTA/VREF sensor





// ??? SEE WHAT KEY OTHER THINGS NEED TO BE SETUP FOR INTERNAL ADC CHANNELS: TEMP, VBAT/VREF  WVD ??? !!!




          //----------------------------------------------------------------
          // setup the step/RANK within the sequencer to use
          //----------------------------------------------------------------
    orig_step_num = step_num;          // save the step number passed on entry
    if (step_num == ADC_AUTO_STEP)
       step_num = adc_blk->adc_step_num;  // use our internally managed rank #

       //-----------------------------------------------------------------
       // Configure the associated ADC channel     (as a regular channel)
       //
       // Note: Based on the intterupts (IT) that occur after each number
       //       "uhADCxConvertedValue"  ADC conversions (IT by DMA end
       //       of transfer), select sampling time and ADC clock with sufficient
       //       duration as to not create an overhead situation in IRQHandler.
       //
       // Note that "Rank" is really sequence id - the sequence in which
       // these will fire, starting at one, and going up.
      //-----------------------------------------------------------------
    _g_ChanConfig.Channel      = chan_blkp->chan_adc_id; // set ADC channel #
#if defined(ADC_CHANNEL_LEVEL_SAMPLING_TIME)
    _g_ChanConfig.SamplingTime = ADC_SAMPLETIME_DEFLT;
#endif
#if defined(ADC_HAS_SQR_L)
    _g_ChanConfig.Rank         = step_num;       // set step/RANK # in sequencer
#else
           // some MCUs like L0, assign the channels in the order they
           // were configured and do not have a formal SQR_L setting.
           // They're ADC channel selection is done in fixed fashion
           // via the ADC_CHSELR register.
#endif
#if defined(ADC_USES_CONFIG_OFFSET)
    _g_ChanConfig.Offset       = 0;
#endif

    rc = HAL_ADC_ConfigChannel (&adc_blk->adc_Handle, &_g_ChanConfig);
    if (rc != HAL_OK)
       {
            /* Channel Configuration Error */
         return (ERR_ADC_CHANNEL_INITIALIZATION_ERROR);
       }

          // save the step number that was used for this channel
    adc_blk->adc_step_map [channel_num+INT_OFFSET] = (char) step_num;

    if (orig_step_num == ADC_AUTO_STEP)
       adc_blk->adc_step_num++;          // inc to next step slot in the sequencer

          // track how many channels have been configured for use
    adc_blk->adc_active_channels++;

