GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
    return (0);                          // denote success
}


//*****************************************************************************
//  board_adc_check_conversions_completed
//
//          Checks if the ALL the conversions for a sinple ADC are done.
//
//          For groups, the starting channel of the group, as specified as
//          the first channel listed in the board_adc_group_init() channels[]
//          array, is passed.
//
//          Returns:
//              True  (1) = Completed
//              False (0) = Busy
//*****************************************************************************
int  board_adc_check_conversions_completed (unsigned int module_id, int sequencer)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if (adc_blk->ADC_DMA_complete == ADC_DMA_STATE_IO_COMPLETE)
       return (1);                       // All conversions are completed

    return (0);                          // ADC and DMA are still busy
}


//*****************************************************************************
//  board_adc_disable
//
//          Turn off one or all the sequencers that have been configured.
//
//          Reset everything in preparattioon for a re-configuratioon of
//          channels.
//*****************************************************************************
int  board_adc_disable (unsigned int module_id, int sequencer)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    HAL_ADC_Stop_DMA (&adc_blk->adc_Handle);

    return (0);                                     // denote success
}


//*****************************************************************************
//  board_adc_enable
//
//         Turn on one or all the sequencers that have been configured.
//
//         We use DMA for all ADC transfers, which by definition always runs
//         in interruipt mode. Upon DMA completion, the XXXX rtn is called.
//
//         callback_function and callback_parm are optional, to provide callback
//         when the ADC conversions are complete. If you want to poll for
//         result instead, set both of them to 0L (zero + L) aka NULL.
//*****************************************************************************
int  board_adc_enable (unsigned int module_id, int sequencer)
{
    uint32_t   DataEntries;
    int        rc;
    ADC_IO_CONTROL_BLK  *adc_blk;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if ( !  adc_blk->adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

    adc_blk->ADC_DMA_complete = ADC_DMA_STATE_INITAL_START;  // Denote initial
                                    // Start conversion was issued.
                                    // The HAL_ADC_Start_DMA() below _always_
                                    // initiates the first ADC conversion,
                                    // even if tagged as USER_APP Trigger.
    adc_blk->adc_DMA_overrun  = 0;  // clear overflow flag

        //------------------------------------------------------------------
        // Update the "Number of Copnversions" in the ADC block
        // based upon the final number of channels configured.
        // To do this, we must update the ADC_SQR1_L field in SQR1 register.

        // Note that L count field is always N - 1 channels.

        // Note:  L0/F0 do not have SQRx registers. or max counts.
        // Instead, each channel to be scanned has its bit turned on in the
        // ADC_CHSELR reg, which is setup during HAL_ADC_ConfigChannel()

        //------------------------------------------------------------------
#if defined(ADC_HAS_SQR_L) || defined(STM32F334x8) || defined(STM32F303xE)
  #if defined(STM32F072xB) || defined(STM32F091xC)
              // F0 uses ADC_CHSEL sequencer bits that was setup in call to
              // HAL_ADC_Channel_Config
  #else
    adc_blk->adc_Handle.Instance->SQR1 &= ~(ADC_SQR1_L);       // clear the bits
    #if defined(ADC_SQR1)
           // note that the macro ADC_SQR1 subtracts one from the count _and_
           // shifts it by 20 bits to put the value into the ADC_SQR1_L position
       adc_blk->adc_Handle.Instance->SQR1 |=  ADC_SQR1(adc_blk->adc_active_channels);    // F4, F7, L4
    #elif defined(__ADC_SQR1_L)
       adc_blk->adc_Handle.Instance->SQR1 |= __ADC_SQR1_L(adc_blk->adc_active_channels); // L1
    #else
       MODIFY_REG (adc_blk->adc_Handle.Instance->SQR1, ADC_SQR1_L, (adc_blk->adc_active_channels - 1));  // L0
    #endif
  #endif
#endif
        //----------------------------------------------------------------------
        // the following both starts the ADC and apparently auto-initiates
        // the first Conversion IFF SW initiated, else lets trigger do its thing
        //----------------------------------------------------------------------
    DataEntries = adc_blk->adc_active_channels * 1;  // set # entries that DMA should xfer
    rc = HAL_ADC_Start_DMA (&adc_blk->adc_Handle, (uint32_t*) &adc_blk->adc_conv_results,
                            DataEntries);
    if (rc != HAL_OK)
       {
            /* Had a start Conversion Error */
         return (ERR_ADC_ENABLE_ERROR);
       }
    return (0);                                    // denote success
}


//******************************************************************************
//  board_adc_get_io_control_block
//
//            Locate and return the control/status block, containing key
//            operating fields, flags, and values, based on module id.
//******************************************************************************
ADC_IO_CONTROL_BLK  *board_adc_get_io_control_block (unsigned int module_id)
{
    if (module_id > ADC_MAX_MODULES)
       return (0L);

#if defined(ADC_1_MODULES)
    return (&_g_adc_io_ctl_block_1);        // there is only 1 ADC module on MCU
#endif

#if defined(ADC_2_MODULES)
    if (module_id == 2)
       return (&_g_adc_io_ctl_block_2);
       else return (&_g_adc_io_ctl_block_1);
#endif

#if defined(ADC_3_MODULES)
    if (module_id == 3 || module_id == ADCMD)
       return (&_g_adc_io_ctl_block_3);               // L4 ADC default is ADC3
       else if (module_id == 2)
               return (&_g_adc_io_ctl_block_2);
       else return (&_g_adc_io_ctl_block_1);
#endif

#if defined(ADC_4_MODULES)
    if (module_id == 4)
       return (&_g_adc_io_ctl_block_4);
       else if (module_id == 3)
               return (&_g_adc_io_ctl_block_3);
       else if (module_id == 2)
               return (&_g_adc_io_ctl_block_2);
       else return (&_g_adc_io_ctl_block_1);
#endif

