GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
}


//*****************************************************************************
//  board_adc_get_resolution
//
//          Get the resolution of the ADC as either 6, 8, 10, or 12 bits.
//*****************************************************************************
int  board_adc_get_resolution (unsigned int module_id)
{
    ADC_IO_CONTROL_BLK  *adc_blk;
    uint32_t         hw_value;
    int              bit_resolution;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

bit_resolution = 12;
// TBD - get ADC register directly or call HAL API to do so ...

// then convert result to one of the following (or via table)
//  case ADC_6_BIT_RESULITION:
//  case ADC_8_BIT_RESULITION:
//  case ADC_10_BIT_RESULITION:
//  case ADC_128_BIT_RESULITION:

    return (bit_resolution);          // return bit resolution setting
}


//*****************************************************************************
//  board_adc_get_results
//
//          Returns an array of all the ADC values that were converted,
//          related to a/all the sequenced group(s)
//
//          Return code:  0 = ADC conversion not completed yet (error)
//                        N (1-16) = number of channels processed/completed
//                       -1 = error  (e.g. DMA overrun)
//*****************************************************************************
int  board_adc_get_results (unsigned int module_id, int sequencer,
                            uint16_t *channel_results)
{
    uint32_t  adc_module;
    int      i;
    ADC_IO_CONTROL_BLK  *adc_blk;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if ( ! adc_blk->adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

    if (adc_blk->ADC_DMA_complete < ADC_DMA_STATE_IO_COMPLETE)
       return (0);     // denote 0 results because DMA rupt has not happened yet

    if (adc_blk->adc_DMA_overrun)
       {    // we had an overrun. Discard the results and tell user try again
         adc_blk->adc_DMA_overrun  = 0;                    // clear error flag
         adc_blk->ADC_DMA_complete = ADC_DMA_STATE_RESET;  // reset for new pass
         return (-1);          // denote we had an overrun condition
       }
    for (i = 0;  i < adc_blk->adc_active_channels;  i++)
       {       // copy the internally DMA staged results into user's buffer
         channel_results[i] = adc_blk->adc_conv_results[i];
       }

    adc_blk->ADC_DMA_complete = ADC_DMA_STATE_RESULTS_READ; //setup for new pass

    return (adc_blk->adc_active_channels); // pass back number of completed conversions
}


//*****************************************************************************
//  board_adc_get_app_trigger_masks
//
//          Pass back the trigger related masks that the User App requested
//          via ADC calls.
//          This is invoked by Timer logic to make sure both side are in
//          sync, when board_timerpwm_config_trigger_mode() is called.
//*****************************************************************************

void  board_adc_get_app_trigger_masks (unsigned int adc_module_id,
                                       uint16_t *app_trigger_tmr_mmsmask,
                                       uint16_t *app_trigger_user_api_id)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (adc_module_id);

    *app_trigger_tmr_mmsmask = adc_blk->adc_trigger_tmr_mmsmask;
    *app_trigger_user_api_id = adc_blk->adc_trigger_user_api_id;
}


//*****************************************************************************
//  board_adc_lookup_trigger
//
//          Lookup up specific trigger entry that was requested by User App.
//          This walks through the trigger table, to find the associated entry
//          and all its associated parameters.
//*****************************************************************************
ADC_TRIGGER_BLK  *board_adc_lookup_trigger (unsigned int module_id, int trigger_type,
                                            ADC_IO_CONTROL_BLK *adc_blk, int flags)
{
    ADC_TRIGGER_BLK  *trigblkp;

    trigblkp = (ADC_TRIGGER_BLK*) board_adc_get_trigger_block (module_id, trigger_type);

    while (1)
      { if (trigblkp->trigger_user_api_id == -1)
           return (0L);                            // end of table and no match
        if (trigblkp->trigger_user_api_id == trigger_type)
           {     // setup adc_blk->adc_Handle.Init with proper Trigger flags
             adc_blk->adc_Handle.Init.ExternalTrigConv = trigblkp->trigger_adc_extmask;
             if (flags & ADC_TRIGGER_FALLING)
                   adc_blk->adc_Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_FALLING;
                          else if (flags & ADC_TRIGGER_RISEFALL)
                                  adc_blk->adc_Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING;
                                  else adc_blk->adc_Handle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
                           // save rest of parms to tb used at adc_enable() and timerpwm_enable()
                       adc_blk->adc_trigger_adc_extmask  = trigblkp->trigger_adc_extmask; // ADC EXTSEL
                       adc_blk->adc_trigger_tmr_mmsmask = trigblkp->trigger_tmr_mmsmask; // TIM MMS
                       adc_blk->adc_trigger_user_api_id = trigger_type;
                           // the User API trigger type is an encoded field
                           // where the low order 4 bits = CCR, and the rest = index
                           // number of associated Timer/PWM
                       if (trigblkp->trigger_tmr_mmsmask != 0)      // a GEXTI GPIO pin = 0
                          adc_blk->adc_trigger_timer = (trigger_type >> 4); // save Timer/PWM index
                       break;             // bail out of loop
           }
        trigblkp++;             // step to next entry in array
      }

