GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
    return (trigblkp);          // return the entry we found
}


//*****************************************************************************
//  board_adc_user_trigger_start
//
//          Trigger sampling for a group of ADCs, on a sequenced group
//*****************************************************************************
int  board_adc_user_trigger_start (unsigned int module_id, int trigger_type)
{
    uint32_t         DataEntries;
    int              rc;
    ADC_IO_CONTROL_BLK  *adc_blk;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if ( ! adc_blk->adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

    if (adc_blk->ADC_DMA_complete < ADC_DMA_STATE_IO_COMPLETE)
       return (ERR_ADC_STILL_BUSY);  // did not complete previous conversion yet

    adc_blk->ADC_DMA_complete = ADC_DMA_STATE_BUSY;  // denote starting I/O
    adc_blk->adc_DMA_overrun  = 0;               // clear I/O flags for new pass

        // apparently, to start another ADC conversion, you must issue
        // another xxx_Start_IT()  or  xxx_Start_DMA() request !
// DMA was already initialized and setup for circular mode (effectively resets
// after every cycle). So all we want to do now is trigger the ADC Start again.
// Do not re-init everything, it can cause crashes/faults
//  DataEntries = adc_blk->adc_active_channels * 1;   // set # entries that DMA should xfer
//  rc = HAL_ADC_Start_DMA (&adc_blk->adc_Handle, (uint32_t*) &adc_blk->adc_conv_results,
//                          DataEntries);
    rc = HAL_ADC_Start_IT (&adc_blk->adc_Handle); // Issue software start (SW) to ADC and DMA
    if (rc != HAL_OK)
       {
            /* Had a start Conversion Error */
         adc_blk->ADC_DMA_complete = ADC_DMA_STATE_IO_ERROR;
         return (ERR_ADC_START_CONVERSION_ERROR);
       }

    return (0);                                   // denote success
}


//*****************************************************************************
//  board_adc_set_callback
//
//          callback_function and callback_parm are used to provide callback
//          when the ADC conversions are complete.
//*****************************************************************************
int  board_adc_set_callback (unsigned int module_id,
                             ADC_CB_EVENT_HANDLER  callback_function,
                             void *callback_parm)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

        //----------------------------------------------------------------
        // Save ADC completion callback parameters.
        //----------------------------------------------------------------
    adc_blk->adc_callback_handler = callback_function;
    adc_blk->adc_callback_parm    = callback_parm;

    return (0);                           // denote success
}


//*****************************************************************************
//  board_adc_set_resolution
//
//          Change the resolution of the ADC to 6, 8, 10, or 12 bits.
//          The default is always 12 bits.
//*****************************************************************************
int  board_adc_set_resolution (unsigned int module_id, int bit_resolution)
{
    ADC_IO_CONTROL_BLK  *adc_blk;
    uint32_t         hw_value;

       // Get the associated control and status params for this ADC module
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (module_id);
    if (adc_blk == 0L)
       return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    switch (bit_resolution)
      { case ADC_6_BIT_RESOLUTION:
            hw_value = 6;            // FILL IN REAL VALUE -
//#define ADC_RESOLUTION12b     ((uint32_t)0x00000000)       /*  ADC 12-bit resolution */
//#define ADC_RESOLUTION10b     ((uint32_t)ADC_CFGR1_RES_0)  /*  ADC 10-bit resolution */
//#define ADC_RESOLUTION8b      ((uint32_t)ADC_CFGR1_RES_1)  /*  ADC 8-bit resolution */
//#define ADC_RESOLUTION6b      ((uint32_t)ADC_CFGR1_RES)    /*  ADC 6-bit resolution */
            break;
        case ADC_8_BIT_RESOLUTION:
            hw_value = 8;            // FILL IN REAL VALUE -
            break;
        case ADC_10_BIT_RESOLUTION:
            hw_value = 10;           // FILL IN REAL VALUE -
            break;
        case ADC_12_BIT_RESOLUTION:
            hw_value = 12;           // FILL IN REAL VALUE -
            break;
         default:
            return (ERR_ADC_INVALID_BIT_RESOLUTION);
      }

// TBD - update ADC register directly or call HAL API to do so ...

    return (0);                           // denote success
}


/****************************************************************************
*                             ADC  ISR   Callback
*
*         ADC Conversion complete callback in non-blocking mode.
*         Called from DMA/ADC ISR Handler.
*
*         If running straight interrupts (xxx_IT), this gets called by
*         the HAL ADC library support when the ADC interrupt completes.
*
*         If running with DMA (xxx_DMA), this gets called
*         when the DMA interrupt completes, i.e. this gets
*         invoked as a callback indirectly via the HAL_DMA_IRQHandler()
*
* @param  adc_blk->adc_Handle : adc_blk->adc_Handle handle
* @note   This example shows a simple way to report end of conversion,
*         and you can add your own implementation.
* @retval None
****************************************************************************/
void   HAL_ADC_ConvCpltCallback (ADC_HandleTypeDef *adc_Handle)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

    adc_rupt_cb_seen++;                        // DEBUG COUNTER

// ??? !!!  ADD REST OF SUPPORT FOR THIS on 06/26/15 ---- ??? !!!
#if (ADC_SINGLE_MODULE)
    adc_blk = board_adc_get_io_control_block (ADC_MD);          // only 1 ADC module
#else
    if (adc_Handle->Instance == _g_adc_io_ctl_block_1.adc_Handle.Instance)
       adc_blk = &_g_adc_io_ctl_block_1;
       else if (adc_Handle->Instance == _g_adc_io_ctl_block_2.adc_Handle.Instance)
               adc_blk = &_g_adc_io_ctl_block_2;
  #if defined(ADC_3_MODULES) || defined(ADC_4_MODULES)
       else if (adc_Handle->Instance == _g_adc_io_ctl_block_3.adc_Handle.Instance)
               adc_blk = &_g_adc_io_ctl_block_3;
  #endif
  #if defined(ADC_4_MODULES)
       else if (adc_Handle->Instance == _g_adc_io_ctl_block_4.adc_Handle.Instance)
               adc_blk = &_g_adc_io_ctl_block_4;
  #endif
       else return;           // completely unknwon Handle ==> user specific
#endif


#if (ALWAYS_USING_DMA)
       // we are always using DMA, so this causes false trigger/callbacks to
       // user app, which can cause confusion and hangs at User App level,
       // because this callback is invoked by HAL at ADC complete, and it
       // also calls the DMA callback (below) at DMA complete.
       // Worse yet, the HAL turd calls this twice (once at Half-Convert and
       // once at Full convert complete), even  though we did not ask for
       // the Half-Complete callback. Thanks for nothing !
       //-------------------------------------------------------------
       // If a ADC completion callback has been configured, invoke it
       //-------------------------------------------------------------
    if (adc_blk->adc_callback_handler != 0L)
       {
          (adc_blk->adc_callback_handler) (adc_blk->adc_callback_parm,
                                           adc_blk->adc_conv_results,
                                           adc_blk->adc_active_channels,
                                           0);       // invoke user handler
       }
#endif
}


/************************************************************************
*                              DMA    ADC1    ISR
*
* @brief  This handles the DMA interrupt request for the 1st ADC DMA channel.
*         It routes it to the ST hAL library, which does some
*         pre-pcoessing on it, then invokes the associated
*         callback we defined (HAL_ADC_ConvCpltCallback)
*
* @param  None
* @retval None
************************************************************************/


// 09/03/15 ??? !!! WVD FIX - F3 03 has 4 separate ADCs and 4 separate DMAs - need to add
//                            F7 has 3 ADC and 3 separate DMAs

void  DMA_ADC1_ISR_IRQHandler (void)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

    dma_rupt_seen++;                               // DEBUG COUNTER

