GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (ADC_M1);

    adc_blk->ADC_DMA_complete = ADC_DMA_STATE_IO_COMPLETE;   // set status that
                             // ADCs and DMA I/O has completed.
                             // Used by adc_Check_All_Complete() logic.
                             // Alternative option = invoke user callback rtn.

// ??? is the following really needed - should I just clear it in here and be done with it ???
// 07/26/15 - BAD BAD  The following is potentially screwing things up - since it
//            calls the above HAL_ADC_ConvCpltCallback() so the User App gets
//            two ADC callbacks for 1 completion.  BADDD !!
    HAL_DMA_IRQHandler (adc_blk->adc_Handle.DMA_Handle);  // Call post rupt cleanup
                                                   //   and reset rupt flags

       //-------------------------------------------------------------
       // If a ADC completion callback has been configured, invoke it
       //-------------------------------------------------------------
    if (adc_blk->adc_callback_handler != 0L)
       {
          (adc_blk->adc_callback_handler) (adc_blk->adc_callback_parm,
                                           adc_blk->adc_conv_results,
                                           adc_blk->adc_active_channels,
                                           0);        // Invoke user handler
       }

//  HAL_ADC_Stop_DMA(hadc);  // ??? need - bit is blow up when re-enable ADC_IT
}


#if defined(ADC_2_MODULES) || defined(ADC_3_MODULES) || defined(ADC_4_MODULES)
/************************************************************************
*                              DMA    ADC2    ISR
*
* @brief  This handles the DMA interrupt request for the 2nd ADC DMA channel.
*         It routes it to the ST hAL library, which does some
*         pre-pcoessing on it, then invokes the associated
*         callback we defined (HAL_ADC_ConvCpltCallback)
*
* @param  None
* @retval None
************************************************************************/

void  DMA_ADC2_ISR_IRQHandler (void)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

    dma_rupt_seen++;                               // DEBUG COUNTER

    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (ADC_M2);

    adc_blk->ADC_DMA_complete = ADC_DMA_STATE_IO_COMPLETE;   // set status that
                             // ADCs and DMA I/O has completed.
                             // Used by adc_Check_All_Complete() logic.
                             // Alternative option = invoke user callback rtn.

// ??? is the following really needed - should I just clear it in here and be done with it ???
// 07/26/15 - BAD BAD  The following is potentially screwing things up - since it
//            calls the above HAL_ADC_ConvCpltCallback() so the User App gets
//            two ADC callbacks for 1 completion.  BADDD !!
    HAL_DMA_IRQHandler (adc_blk->adc_Handle.DMA_Handle);  // Call post rupt cleanup
                                                       //   and reset rupt flags

       //-------------------------------------------------------------
       // If a ADC completion callback has been configured, invoke it
       //-------------------------------------------------------------
    if (adc_blk->adc_callback_handler != 0L)
       {
          (adc_blk->adc_callback_handler) (adc_blk->adc_callback_parm,
                                           adc_blk->adc_conv_results,
                                           adc_blk->adc_active_channels,
                                           0);        // Invoke user handler
       }

//  HAL_ADC_Stop_DMA(hadc);  // ??? need - bit is blow up when re-enable ADC_IT
}
#endif


#if defined(ADC_3_MODULES) || defined(ADC_4_MODULES)
/************************************************************************
*                              DMA    ADC3    ISR
*
* @brief  This handles the DMA interrupt request for the 3rd ADC DMA channel.
*         It routes it to the ST hAL library, which does some
*         pre-pcoessing on it, then invokes the associated
*         callback we defined (HAL_ADC_ConvCpltCallback)
*
* @param  None
* @retval None
************************************************************************/

void  DMA_ADC3_ISR_IRQHandler (void)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

    dma_rupt_seen++;                               // DEBUG COUNTER

    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (ADC_M3);

    adc_blk->ADC_DMA_complete = ADC_DMA_STATE_IO_COMPLETE;   // set status that
                             // ADCs and DMA I/O has completed.
                             // Used by adc_Check_All_Complete() logic.
                             // Alternative option = invoke user callback rtn.

// ??? is the following really needed - should I just clear it in here and be done with it ???
// 07/26/15 - BAD BAD  The following is potentially screwing things up - since it
//            calls the above HAL_ADC_ConvCpltCallback() so the User App gets
//            two ADC callbacks for 1 completion.  BADDD !!
    HAL_DMA_IRQHandler (adc_blk->adc_Handle.DMA_Handle);  // Call post rupt cleanup
                                                   //   and reset rupt flags

       //-------------------------------------------------------------
       // If a ADC completion callback has been configured, invoke it
       //-------------------------------------------------------------
    if (adc_blk->adc_callback_handler != 0L)
       {
          (adc_blk->adc_callback_handler) (adc_blk->adc_callback_parm,
                                           adc_blk->adc_conv_results,
                                           adc_blk->adc_active_channels,
                                           0);        // Invoke user handler
       }

//  HAL_ADC_Stop_DMA(hadc);  // ??? need - bit is blow up when re-enable ADC_IT
}
#endif


#if defined(ADC_4_MODULES)
/************************************************************************
*                              DMA    ADC4    ISR
*
* @brief  This handles the DMA interrupt request for the 4th ADC DMA channel.
*         It routes it to the ST hAL library, which does some
*         pre-pcoessing on it, then invokes the associated
*         callback we defined (HAL_ADC_ConvCpltCallback)
*
* @param  None
* @retval None
************************************************************************/

void  DMA_ADC4_ISR_IRQHandler (void)
{
    ADC_IO_CONTROL_BLK  *adc_blk;

    dma_rupt_seen++;                               // DEBUG COUNTER

    adc_blk = (ADC_IO_CONTROL_BLK*) board_adc_get_io_control_block (ADC_M4);

