GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/board_STM32_adcs.c
    adc_blk->ADC_DMA_complete = ADC_DMA_STATE_IO_COMPLETE;   // set status that
                             // ADCs and DMA I/O has completed.
                             // Used by adc_Check_All_Complete() logic.
                             // Alternative option = invoke user callback rtn.

// ??? is the following really needed - should I just clear it in here and be done with it ???
// 07/26/15 - BAD BAD  The following is potentially screwing things up - since it
//            calls the above HAL_ADC_ConvCpltCallback() so the User App gets
//            two ADC callbacks for 1 completion.  BADDD !!
    HAL_DMA_IRQHandler (adc_blk->adc_Handle.DMA_Handle);  // Call post rupt cleanup
                                                   //   and reset rupt flags

       //-------------------------------------------------------------
       // If a ADC completion callback has been configured, invoke it
       //-------------------------------------------------------------
    if (adc_blk->adc_callback_handler != 0L)
       {
          (adc_blk->adc_callback_handler) (adc_blk->adc_callback_parm,
                                           adc_blk->adc_conv_results,
                                           adc_blk->adc_active_channels,
                                           0);        // Invoke user handler
       }

//  HAL_ADC_Stop_DMA(hadc);  // ??? need - bit is blow up when re-enable ADC_IT
}
#endif

/******************************************************************************/
